[
    {
        "service_id": "04",
        "title": "HTML5",
        "img": "https://www.tutorialrepublic.com/lib/images/html-illustration.png",
        "price": "$ 19.00",
        "description": "This HTML tutorial series covers all the fundamentals of HTML, including the idea of elements and attributes, way of formatting the text using HTML tags, methods of adding the style information to the document, technique of inserting images and tables, process of creating lists and forms as well as method of including other HTML documents inside the current document, and so on. Once you're familiar with the basics, you'll move on to next level that explains the concept of doctype, methods for creating the web page layouts, importance of adding meta information to the web pages, way of adding scripts, techniques of showing special characters, anatomy of a URL, and more. Finally, you'll explore some advanced features introduced in HTML5 such as new input types, drawing graphics on the webpage, including audios and videos in the document, storing data on client-side using web storage, caching files, performing background work with web worker, as well as getting user's geographical coordinates, creating drag and drop application, and so on."
        
    },
    {
        "service_id": "05",
        "title": "CSS3",
        "img": "https://www.tutorialrepublic.com/lib/images/css-illustration.png",
        "price": "$ 25.00",
        "description": "This CSS tutorial series covers all the fundamentals of CSS, including the idea of selectors, methods of setting colors and backgrounds, way of formatting fonts and text, styling UI elements such as hyperlinks, lists, tables, etc. as well as the concept of CSS box model, and so on. Once you're comfortable with the basics, you'll move on to next level that explains the way of setting dimension and alignment of elements, methods for positioning elements on a web page, using image sprites, as well as the concept of relative and absolute units, visual formatting model, display and visibility, layers, pseudo classes and elements, media dependent style sheets, and so on.Finally, you'll explore some advanced features introduced in CSS3 like gradient colors, drop shadow effect, 2D and 3D transforms, alpha transparency, as well as the method of creating transition and animation effect, flex layouts, filter effect, the concept of media queries, and more."        
    },
    {
        "service_id": "01",
        "title": "Bootstrap 5",
        "img": "https://www.tutorialrepublic.com/lib/images/bootstrap-5.0-illustration.png",
        "price": "$ 200.00",
        "description": "Bootstrap is a powerful front-end framework for faster and easier web development. It includes HTML and CSS based design templates for creating common user interface components like forms, buttons, navigations, dropdowns, alerts, modals, tabs, accordions, carousels, tooltips, and so on. Bootstrap gives you ability to create flexible and responsive web layouts with much less efforts. Bootstrap was originally created by a designer and a developer at Twitter in mid-2010. Before being an open-sourced framework, Bootstrap was known as Twitter Blueprint. You can save a lot of time and effort with Bootstrap. So bookmark this website and continue on. This Bootstrap tutorial series covers all the features of the Bootstrap framework, starting with the basics, such as grid system, typography styling mechanism, form styling methods, as well as, techniques of styling common user interface elements like tables, lists, images, etc. Further you will learn how to utilize the ready to use Bootstrap components such as list groups, input groups, button groups, cards, navbar, breadcrumbs, pagination, labels and badges, progress bars, etc. as well as how to customize them to create their different variations.Finally, you will explore some advanced features of the Bootstrap like creating modal window, dynamic tabs, tooltips, alerts, accordion menu, carousel, scrollspy, etc. as well as how to customize them or extend their existing functionality using the available options and methods."
       
    },
    {
        "service_id": "02",
        "title": "JAVASCRIPT",
        "img": "https://www.tutorialrepublic.com/lib/images/javascript-illustration.png",
        "price": "$ 150.00",
        "description": "This JavaScript tutorial series covers all the fundamental programming concepts, including data types, operators, creating and using variables, generating outputs, structuring your code to make decisions in your programs or to loop over the same block of code multiple times, creating and manipulating strings and arrays, defining and calling functions, and so on. Once you're comfortable with the basics, you'll move on to next level that explains the idea of objects, the Document Object Model (DOM) and Browser Object Model (BOM), as well as how to make use of the native JavaScript objects like Date, Math, etc., and perform type conversions. Finally, you'll explore some advanced concepts like event listeners, event propagation, borrowing methods from other objects, hoisting behavior of JavaScript, encoding and decoding JSON data, as well as detailed overview of new features introduced in ECMAScript 6 (or ES6)."
        
    },
    {
        "service_id": "03",
        "title": "JQUERY",
        "img": "https://www.tutorialrepublic.com/lib/images/jquery-illustration.png",
        "price": "$ 199.00",
        "description": "This jQuery tutorial series covers all the features of the jQuery, including its selector mechanism, event handling system, as well as, effect methods to create interactive user interface features like showing and hiding elements, animating the elements on a web page, etc. Later you will see some other interesting features of the jQuery such as chaining multiple methods, as well as how to perform common DOM manipulation task such as get or set contents and values of an HTML element on a web page, add or remove elements or their attributes, get and set CSS properties of an element, get or set width and height of the element, and so on. Finally, you will explore one of the most powerful features of jQuery that is traversing the DOM tree to get the child, parent and sibling elements, as well as features like filtering element's selection, implementing Ajax to retrieve the information from a server and update the page content without refreshing it, and how to avoid conflicts between jQuery and other JavaScript library"
        
    },
    {
        "service_id": "06",
        "title": "SQL",
        "img": "https://www.tutorialrepublic.com/lib/images/sql-illustration.png",
        "price": "$ 200.00",
        "description": "This SQL tutorial series covers all the fundamental concepts of SQL language, such as creating database and tables, using constraints, adding records to a table, selecting records from a table based on different conditions, updating and deleting records in a table, and so on. Once you're familiar with the basics, you'll move on to next level that explains the methods of retrieving records through joining multiple tables, searching records in the table based on pattern, etc.Finally, you'll explore some advanced concepts, such as modifying the existing table structure, performing aggregations and grouping data together, creating views to simplify and secure table access, creating indexes for tables, handling dates and times, cloning of an existing table, creating temporary tables, as well as, concept of SQL subqueries and SQL injection."
        
    }
]